using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;


namespace Common
{
    public partial class Help : Form
    {
        private string caller;

        public Help(string caller)
        {
            this.caller = caller;
            InitializeComponent();
        }

        private void Help_Load(object sender, EventArgs e)
        {
            switch (caller)
            {
                case "Registrator":
                    {
                        label1.Text = "Довідка модуля Реєстратор";
                        richTextBox1.Lines = new string[] 
                        {
                            "Модуль Реєстратор дозволяє зареєструвати нових пацієнтів в системі, підтримувати актуальність інформації про них, а також записувати їх на прийом до лікарів клініки.",
                          "Для перегляду представлені 3 таблиці БД:",
                          " - Пацієнти;",
                          " - Лікарі;",
                          " - Прийоми.",
                          "",
                          "Перегляд здійснюється шляхом вибору відповідного пункта в пункті меню Огляд -> Назва таблиці. Також можна обрати відповідний пункт на панелі інструментів.",
                          "В залежності від таблиці, яка демонструється, буде різний додатковий функціонал нижче на формі.",
                          " - Для таблиці пацієнтів:",
                          "Можна зареєструвати нового пацієнта;",
                          "Можна редагувати дані про вибраного пацієнта шляхом натискання відповідної кнопки чи подвійним натисканням ЛКМ по рядку;",
                          "У вікні редагування можна одразу записати обраного пацієнта на прийом чи видалити пацієнта, якщо у нього не було ще проведених прийомів.",
                          "",
                          " - Для таблиці прийомів:",
                          "Можна оформити новий прийом;",
                          "Редагувати дані після не можна.Потрібно скасувати неактуальний прийом та створити новий;",
                          "Можна скасувати прийом, якщо він ще не був проведений.",
                          "",
                          " - Для таблиці лікарів:",
                          "Тільки перегляд.",
                          "",
                          "Компонент перегляду табличних даних дозволяє сортувати наявні записи по окремих рядках за зростанням чи спаданням.Для цього потрібно натиснути на заголовок стовпчика.",
                          "",
                          "Додатково для всіх таблиць активний пошук.",
                          "Після введення пошукового запиту, наприклад, 'Ковальчук', та натискання клавіші 'Enter' алгоритм шукатиме наявність цієї послідовності символів у певних стовпчиках поточної таблиці, незалежно від регістру.",
                          "Якщо пошук успішний, в таблиці залишаться лише результат пошуку(набір рядків). Можна здійснити уточнювальний пошук серед результатів попереднього, уточнивши свій запит.",
                          "Аби скинути результати пошуку, потрібно очистити пошуковий рядок та натиснути 'Enter' або оновити подання поточної таблиці, обравши потрібну в меню.",
                          "",
                          " - Для таблиці пацієнтів:",
                          "Пошук по стовпчику ПІБ(можна вводити частину ПІБ та уточнювати);",
                          "Пошук за номером телефону;",
                          "Пошук за датою народження як цілком, так і окремо(за днем, наприклад '01.'), (за місяцем, наприклад '.05.'), (за роком, наприклад '.2003');",
                          "Пошук за адресою.",
                          "",
                          " - Для таблиці прийомів:",
                          "Пошук за датою і часом прийому(По частинах також можна);",
                          "Пошук за ПІБ пацієнта;",
                          "Пошук за ПІБ лікаря;",
                          "",
                          " - Для таблиці лікарів:",
                          "Пошук по стовпчику ПІБ(можна вводити частину ПІБ та уточнювати);",
                          "Пошук за номером телефону;",
                          "Пошук за датою народження як цілком, так і окремо(за днем, наприклад '01.'), (за місяцем, наприклад '.05.'), (за роком, наприклад '.2003');",
                          "Пошук за адресою."
                        };
                    }
                    break;
                case "Dentist":
                    {
                        label1.Text = "Довідка модуля Лікар";
                        richTextBox1.Lines = new string[]
                        {
                            "Модуль Лікар дозволяє переглядати прийоми, які були призначені на конкретного лікаря, оформити надані послуги за цим прийомом та видати кошторис, який можна експортувати і роздрукувати за бажанням.",
                            "Для перегляду доступні також довідникові таблиці Пацієнти та Послуги, є пошук. Вибрати можна в меню.",
                            "Перегляд прийомів можливий із застосуванням фільтрів періоду, які доступні на панелі інструментів.",
                            "",
                            "Якщо обрати рядок якогось прийому, його можна оформити, якщо він ще не був завершений, або переглянути інформацію про надані послуги за ним, якщо вже був завершений. В залежності від того, чи був на даний момент прийом проведений, доступна одна з двох опцій - перегляд або оформлення. Вибір на панелі інструменів.",
                            "",
                            "Під час перегляду даних про завершений прийом можна експортувати дані та роздрукувати за бажанням, натиснувши відповідну кнопку.",
                            "",
                            "Під час оформлення прийому можна додати у відповідну таблицю надані послуги, скориставшись відповідною кнопкою, що призведе до відкриття довідника послуг, де можна знайти потрібну послугу та двічі натиснути на потрібний рядок. Потім обирається лікар, який цю послугу надав, ступінь складності, кількість. Спеціально для лікарів є поле для нотаток, яке бачить тільки той лікар, шо провів прийом",
                            "Якщо якась послуга була додана випадково у список, її можна видалити за допомогою відповідної кнопки на формі чи клавіші Del.",
                            "Коли всі надані послуги були занесені в таблицю, можна завершити прийом. Це додасть дані про надані послуги в БД та поставить позначку завершеності у відповідний прийом.",
                        };
                    }
                    break;
                case "Supervisor":
                    {
                        label1.Text = "Довідка модуля Керівник";
                        richTextBox1.Lines = new string[]
                        {
                            "Модуль Керівник дозволяє переглядати статистику по лікарні з надання послуг лікарями, редагувати асортимент послуг, коефіцієнти пільг пацієнтів та коефіцієнти за рівні складності надання тих чи інших послуг. Також можна редагувати перелік лікарів клініки.",
                            "Перегляд статистики доступний на головній формі. Дані підвантажуються з БД. Можна вибрати для кожної діаграми параметри відображення. У разі недопустимості параметів буде показане повідомлення.",
                            "",
                            "Перегляд табличних даних здійснюється за допомогою відповідних пунктів головного меню у вкладці Огляд.",
                            "Послуги можна додавати, редагувати та деактивувати за допомогою відповідних форм. Деактивація замість видалення для збереження цілісності даних. Водночас, можна зручно змінити вартість послуги у вікні редагування від -100% до +100% за раз.",
                            "Категорії послуг можна тільки додавати та редагувати. Для видалення потрібно безпосередньо видалити їх із БД за допомогою інших програмних засобів. Зроблено для збереження цілісності даних.",
                            "Лікарів можна додавати, редагувати і деактивувати. На формі демонстрації табличних даних лікарів можна подивитись, які лікарі не займалися практикою протягом вибраного місяця вибраного року.",
                            "Також є можливість редагування коефіцієнтів рівнів складності. Варто зазначити, що додаток не враховує дати змінення цих значень, тому суми наданих послуг за попередніми зверненнями також зміняться",
                            "",
                            "Якщо у таблицях коефіцієнтів складності та категорій пацієнтів за пільгами немає даних, відповідні форми редагування в додатку відкриються в режимі додавання даних. Тобто можна одразу додати відповідні записи, якщо їх немає."
                        };
                    }
                    break;
            }
    }
    }
}
